app/views/users/show.html.erb

	<tbody>
		<% Ownedcar.where(:user => @user.id).each do |c| %>
---
SELECT "ownedcars".* FROM "ownedcars" WHERE "ownedcars"."user_id" = ?  [["user_id", 1]]