app/workflows/create_user.rb

  def create
    build
    result = user.save
---
INSERT INTO "users" ("username", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "DaveFuck"], ["password", "backerzrule"], ["email", "fuck_David@edmonton.gov"], ["created_at", "2019-04-29 04:05:44.897196"], ["updated_at", "2019-04-29 04:05:44.897196"]]