app/controllers/cars_controller.rb

INSERT INTO "cars" ("year", "make", "model", "coolness_value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["year", 1999], ["make", "Ford"], ["model", "Mustang"], ["coolness_value", 5], ["created_at", "2019-04-22 02:39:43.877966"], ["updated_at", "2019-04-22 02:39:43.877966"]]
---
  def create
    @workflow = CreateCar.new(year: params[:car][:year], make: params[:car][:make], model: params[:car][:model], coolness_value: params[:car][:coolness_value])
    @workflow.create