app/controllers/ownedcars_controller.rb

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "ownedcars" ("year", "make", "model", "coolness_value", "horsepower", "torque", "weight", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

  	car = Car.find(params[:car_id])
  	user = User.find(params[:user_id])
  	#render :inline => "<%= @user.username %>"
  	ownedcar = Ownedcar.create(
  	  year: car.year,
      make: car.make,
      model: car.model,
      coolness_value: car.coolness_value,
      horsepower: car.horsepower,
      torque: car.torque,
      weight: car.weight,
      user: user)