app/controllers/users_controller.rb

SELECT "cars".* FROM "cars"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def add
		@cars = Car.all
		@ownedcar = Ownedcar.new
		@user = User.find(params[:id])

INSERT INTO "users" ("username", "password", "email", "garage_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "Dalton"], ["password", "bigpass123"], ["email", "example@gmail.com"], ["garage_id", 1], ["created_at", "2019-05-08 16:53:40.053236"], ["updated_at", "2019-05-08 16:53:40.053236"]]
INSERT INTO "garages" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-05-08 16:53:40.051693"], ["updated_at", "2019-05-08 16:53:40.051693"]]
UPDATE "garages" SET "user_id" = ?, "capacity" = ?, "car_count" = ?, "updated_at" = ? WHERE "garages"."id" = ?  [["user_id", 1], ["capacity", 1], ["car_count", 0], ["updated_at", "2019-05-08 16:53:40.053955"], ["id", 1]]
---
	def create
		user = User.create(
			username: params[:user][:username],
			password: params[:user][:password],
			email: params[:user][:email])
		user.garage = Garage.create(user: user)
		user.garage.setup(user: user)
		user.garage.save